In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

# Question 1

## load the data of WordsByCharacter
- a. set the index by using column of 'Film', 'Chapter', 'Race', 'Character' 
- b. sort the index of Q1 a.
- c. Access the character of the movie `The Fellowship Of The Ring` from its `first chapter`
- d. how many words are spoken in the first chapter of the movie `The Fellowship Of The Ring`

In [197]:
# load data
df = pd.read_csv(r'WordsByCharacter.csv', encoding='utf8', engine='python')

In [200]:
# a. set the index by using column of 'Film', 'Chapter', 'Race', 'Character'

In [4]:
# b. sort the index of Q1 a.

In [29]:
# c. Access the Character of the movie 'The Fellowship Of The Ring' from its 'first chapter'
df3=(df['Film']=='The Fellowship Of The Ring')&(df['Chapter']=='01: Prologue')
df4=df[df3]
df4['Character']

0        Bilbo
1       Elrond
2    Galadriel
3       Gollum
Name: Character, dtype: object

In [31]:
# d. how many words are spoken in the first chapter of the movie 'The Fellowship Of The Ring'
Q1_4=np.sum(df4['Words'])
Q1_4

489

# Question 2

## Use the `planets` dataset form seaborn package
- a. describe the `planets` dataset by excluding object datatype columns
- b. describe int datatype columns of a `planets` Dataset 
- c. drop na on `planets` dataset, then describe that computes several common aggregates

In [190]:
# loading the 'planets' dataset form seaborn package
planets = sns.load_dataset('planets')
print(planets)

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [176]:
# a. describe the ``planets dataset`` by excluding object datatype columns
planets.describe(exclude=object)

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [178]:
# b. describe int datatype columns of a ``planets Dataset`` 
planets.describe(include=int)

            number         year
count  1035.000000  1035.000000
mean      1.785507  2009.070531
std       1.240976     3.972567
min       1.000000  1989.000000
25%       1.000000  2007.000000
50%       1.000000  2010.000000
75%       2.000000  2012.000000
max       7.000000  2014.000000

In [196]:
# c. drop na on planets dataset, then describe that computes several common aggregates

Q2_df=planets.dropna()
Q2_df.groupby('method').sum()

                 number  orbital_period        mass  distance    year
method
Radial Velocity     863   416215.074604  1248.17138  25751.97  997661
Transit               1        2.703390     1.47000    178.00    2013

# Question 3

## Use US states population and abbreviations dataset
- a. merge the data using many-to-one approach for the data of `pop` and `abbrevs` 
- b. remove the duplicate column whose values are common
- c. check if there are any missing values in the merged dataset of `pop and abbrevs`

In [3]:
# reading the dataset
Q3_df2 = pd.read_csv(r"state-abbrevs.csv", encoding='utf8', engine='python')
Q3_df1 = pd.read_csv(r"state-population.csv", encoding='utf8', engine='python')

In [4]:
# a. merge the data using many-to-one approach for the data of pop and abbrevs

# Here the primary key is state/region (pop) and abbreviation (abbrevs)
# Using how='outer' so that no data is thrown away due to label mismatch
# The values in state/region and abbreviation are common however their column name are different

pd.merge(Q3_df1, Q3_df2, left_on='state/region', right_on='abbreviation',how='outer')

     state/region     ages  year   population    state abbreviation
0              AL  under18  2012    1117489.0  Alabama           AL
1              AL    total  2012    4817528.0  Alabama           AL
2              AL  under18  2010    1130966.0  Alabama           AL
3              AL    total  2010    4785570.0  Alabama           AL
4              AL  under18  2011    1125763.0  Alabama           AL
...           ...      ...   ...          ...      ...          ...
2539          USA    total  2010  309326295.0      NaN          NaN
2540          USA  under18  2011   73902222.0      NaN          NaN
2541          USA    total  2011  311582564.0      NaN          NaN
2542          USA  under18  2012   73708179.0      NaN          NaN
2543          USA    total  2012  313873685.0      NaN          NaN

[2544 rows x 6 columns]

In [5]:
# b. remove the duplicate column whose values are common
# Dropping out the duplicate info
pd.merge(Q3_df1, Q3_df2, left_on='state/region', right_on='abbreviation',how='outer').drop('abbreviation',axis=1)

     state/region     ages  year   population    state
0              AL  under18  2012    1117489.0  Alabama
1              AL    total  2012    4817528.0  Alabama
2              AL  under18  2010    1130966.0  Alabama
3              AL    total  2010    4785570.0  Alabama
4              AL  under18  2011    1125763.0  Alabama
...           ...      ...   ...          ...      ...
2539          USA    total  2010  309326295.0      NaN
2540          USA  under18  2011   73902222.0      NaN
2541          USA    total  2011  311582564.0      NaN
2542          USA  under18  2012   73708179.0      NaN
2543          USA    total  2012  313873685.0      NaN

[2544 rows x 5 columns]

In [14]:
# c. check if there are any missing values in the merged dataset of pop and abbrevs

# Question 4

## Use the dataset of world_population and answer below questions
- a. how many continents do we have in the world?
- b. what are the names of these continents?
- c. how many countries are present in each continent?
- d. what is the population (year 2022) of the world per continent?
- e. what are the most five populous countries (year 2022) in the world?

In [33]:
# reading the dataset
Q4_df = pd.read_csv(r"World_population.csv", encoding='utf8', engine='python')
Q4_df

,Rank,CCA3,Country/Territory,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
0,36,AFG,Afghanistan,Kabul,Asia,41128771,38972230,33753499,28189672,19542982,10694796,12486631,10752971,652230,63.0587,1.0257,0.52
1,138,ALB,Albania,Tirana,Europe,2842321,2866849,2882481,2913399,3182021,3295066,2941651,2324731,28748,98.8702,0.9957,0.04
2,34,DZA,Algeria,Algiers,Africa,44903225,43451666,39543154,35856344,30774621,25518074,18739378,13795915,2381741,18.8531,1.0164,0.56
3,213,ASM,American Samoa,Pago Pago,Oceania,44273,46189,51368,54849,58230,47818,32886,27075,199,222.4774,0.9831,0.00
4,203,AND,Andorra,Andorra la Vella,Europe,79824,77700,71746,71519,66097,53569,35611,19860,468,170.5641,1.0100,0.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
229,226,WLF,Wallis and Futuna,Mata-Utu,Oceania,11572,11655,12182,13142,14723,13454,11315,9377,142,81.4930,0.9953,0.00
230,172,ESH,Western Sahara,El Aaiún,Africa,575986,556048,491824,413296,270375,178529,116775,76371,266000,2.1654,1.0184,0.01
231,46,YEM,Yemen,Sanaa,Asia,33696614,32284046,28516545,24743946,18628700,13375121,9204938,6843607,527968,63.8232,1.0217,0.42
232,63,ZMB,Zambia,Lusaka,Africa,20017675,18927715,16248230,13792086,9891136,7686401,5720438,4281671,752612,26.5976,1.0280,0.25
233,74,ZWE,Zimbabwe,Harare,Africa,16320537,15669666,14154937,12839771,11834676,10113893,7049926,5202918,390757,41.7665,1.0204,0.20

In [86]:
# a. how many continents do we have in the world?
Q4_df1=Q4_df['Continent'].value_counts()
a=Q4_df1.count()
a

6

In [82]:
# b. what are the names of these continents?
Q4_df1

Africa           57
Asia             50
Europe           50
North America    40
Oceania          23
South America    14
Name: Continent, dtype: int64

In [66]:
# c. how many countries are present in each continent?
Q4_df1

Africa           57
Asia             50
Europe           50
North America    40
Oceania          23
South America    14
Name: Continent, dtype: int64

In [99]:
# d. what is the population of the world per continent?
index=Q4_df['Continent']=='Africa'
Q4_df4=Q4_df[index]
Q4_df4
print("Africa",np.sum(Q4_df4['2022 Population']))
index=Q4_df['Continent']=='Asia'
Q4_df4=Q4_df[index]
Q4_df4
print("Asia",np.sum(Q4_df4['2022 Population']))
index=Q4_df['Continent']=='Europe'
Q4_df4=Q4_df[index]
Q4_df4
print("Europe",np.sum(Q4_df4['2022 Population']))
index=Q4_df['Continent']=='North America'
Q4_df4=Q4_df[index]
Q4_df4
print("North America",np.sum(Q4_df4['2022 Population']))
index=Q4_df['Continent']=='Asia'
Q4_df4=Q4_df[index]
Q4_df4
print("Asia",np.sum(Q4_df4['2022 Population']))
index=Q4_df['Continent']=='Oceania'
Q4_df4=Q4_df[index]
Q4_df4
print("Oceania",np.sum(Q4_df4['2022 Population']))
index=Q4_df['Continent']=='South America'
Q4_df4=Q4_df[index]
Q4_df4
print("South America",np.sum(Q4_df4['2022 Population']))

Africa 1426730932
Asia 4721383274
Europe 743147538
North America 600296136
Asia 4721383274
Oceania 45038554
South America 436816608

In [127]:
# e. what are the most five populous countries in the world
Q4_df5=Q4_df['Rank'].sort_values()
print(Q4_df['Country/Territory'][41])
print(Q4_df['Country/Territory'][92])
print(Q4_df['Country/Territory'][221])
print(Q4_df['Country/Territory'][93])
print(Q4_df['Country/Territory'][156])

China
India
United States
Indonesia
Pakistan